---
title: ScheduleFilter
classe: Autodesk.Revit.DB.ScheduleFilter
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# ScheduleFilter

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ScheduleFieldId FieldId { get; set; }` | `scheduleFilter.FieldId` | ScheduleFieldId |
| `ScheduleFilterType FilterType { get; set; }` | `scheduleFilter.FilterType` | ScheduleFilterType |
| `Boolean IsDoubleValue { get; }` | `scheduleFilter.IsDoubleValue` | Boolean |
| `Boolean IsElementIdValue { get; }` | `scheduleFilter.IsElementIdValue` | Boolean |
| `Boolean IsIntegerValue { get; }` | `scheduleFilter.IsIntegerValue` | Boolean |
| `Boolean IsNullValue { get; }` | `scheduleFilter.IsNullValue` | Boolean |
| `Boolean IsStringValue { get; }` | `scheduleFilter.IsStringValue` | Boolean |
| `Boolean IsValidObject { get; }` | `scheduleFilter.IsValidObject` | Boolean |
| `Void Dispose()` | `scheduleFilter.Dispose()` | Void |
| `Double GetDoubleValue()` | `scheduleFilter.GetDoubleValue()` | Double |
| `ElementId GetElementIdValue()` | `scheduleFilter.GetElementIdValue()` | ElementId |
| `Int32 GetIntegerValue()` | `scheduleFilter.GetIntegerValue()` | Int32 |
| `String GetStringValue()` | `scheduleFilter.GetStringValue()` | String |
| `Void SetNullValue()` | `scheduleFilter.SetNullValue()` | Void |
| `Void SetValue(ElementId)` | `scheduleFilter.SetValue(id)` | Void |
| `Void SetValue(String)` | `scheduleFilter.SetValue(string)` | Void |
| `Void SetValue(Double)` | `scheduleFilter.SetValue(value)` | Void |
| `Void SetValue(Int32)` | `scheduleFilter.SetValue(value)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```